
[error]
1=Card was not found!
2=Fail to reset!
3=The card version was mismatch!
4=Warning!
6=Execute Failed!
7=Invalid status!
16=Command Overtime！
17=Command Lost!
19=Interface used by another program!
20=Z Outrange or Z calitable file lost！
21=Paramter mismatch!
23=Allocate memory error!
100=Offline status!
101=Stop!


[4]
1 = Fiber laser core overheat!
2 = Fiber laser core high reflection alarm!
3 = Abnormal fiber laser core MO!
4 = Laser interlocked!
5 = Safety door is open!
6 = Error occurred when closing optical shutter!
7 = Error occurred when opening optical shutter!
8 = Safety door is open and marking paused!
9 = Safety door is open and marking stop!
10= Laser system alarm!
11= Laser voltage over range!
12= Laser overvoltage alarm!
13= Laser undervoltage alarm!
14= SPI Laser overheat alarm!
15= SPI Laser prime amplifier overcurrent alarm!
16= SPI Laser power amplifier overcurrent alarm!
17= SPI Laser collimator alarm!
18= SPI Laser reserved alarm!
19= SPI Laser power alarm!
20= Unknown laser alarm!
21= Laser current overcurrent alarm!
22= Laser power overvoltage alarm!
23= Laser power overheat alarm!
24= Laser power shut down.
100=Safe Door had opened!
110=Touch Left Limit!
111=Touch Right Limit!
112=Touch Home!
500=Scan preheating,please wait a moment!

[door]
1=Safe Door Opened.
2=Safe Door Opened, Marking Paused.
3=Safe Door Opened, Marking Stopped.
4=Safe Door Closed, Marking could be continued.
5=Safe Door Closed, EMCC card is ready to mark.
6=Encounter Negative limit during motor moving.
7=Encounter Postive  limit during motor moving.


[usb]
1=EMCC card connected.
2=EMCC card disconnected.

